app/views/user_mailer/teavitus_email.html.erb

    </p>
    <p><i><%= @comment.created_at %></i></p>
---
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "nnnnnnnnnnnnnnnnn"], ["commenter", "mmmmmmmmmmm"], ["created_at", Tue, 09 Apr 2013 03:09:08 EEST +03:00], ["post_id", 1], ["updated_at", Tue, 09 Apr 2013 03:09:08 EEST +03:00]]