app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
    <td><%= post.content %></td>
    <td class="komm"><%=  post.comments.length %></td>