app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])

    #? snipped for brevity
    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "nnnnnnnnnnnnnnnnn"], ["commenter", "mmmmmmmmmmm"], ["created_at", Tue, 09 Apr 2013 03:09:08 EEST +03:00], ["post_id", 1], ["updated_at", Tue, 09 Apr 2013 03:09:08 EEST +03:00]]