app/controllers/posts_controller.rb

INSERT INTO "posts" ("author_email", "comments_closure", "content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "author_email" = 'maiilu@hotmail.com', "title" = 'hhsssss', "content" = 'AAAAAAA', "updated_at" = '2013-04-09 00:11:43.316122' WHERE "posts"."id" = 3
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "comments_closure" = 't', "updated_at" = '2013-04-09 00:04:15.820369' WHERE "posts"."id" = 1
---
  def closeCommenting
    @post = Post.find(params[:id])
    if @post.closure
        @post.update_attribute(:closure, false)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
  def deleteAllComments
    @post = Post.find(params[:id])
    @post.comments.each do |komment|